{"id":1243,"date":"2020-08-03T18:00:31","date_gmt":"2020-08-03T17:00:31","guid":{"rendered":"https:\/\/susodigital.com\/textbook\/?post_type=module&#038;p=1243"},"modified":"2020-08-10T10:21:51","modified_gmt":"2020-08-10T09:21:51","slug":"writing","status":"publish","type":"module","link":"https:\/\/susodigital.com\/textbook\/module\/content\/writing","title":{"rendered":"Writing Content For Humans (and Search Engines)"},"featured_media":0,"parent":406,"menu_order":36,"template":"","acf":{"module_quiz":"","module_time":"15","module_difficulty":{"value":"easy","label":"Easy"},"module_short_description":"<p>Create content for humans first, then search engines.<\/p>\n","module_long_description":"<p>In this section, we discuss SEO copywriting and the importance of primarily creating content for humans as opposed to search engines and how this varies based on the type of content you are creating.<\/p>\n","video_file":false,"video_url":"","content":"<p>There’s a very good reason why the term “user intent” keeps cropping up all over this textbook.<\/p>\n<p>But if you think about it, why wouldn’t it?<\/p>\n<p>SEO copywriting is the art of writing content that appeals to both humans and search engines.<\/p>\n<p>So without understanding what the searcher is looking for, how are you supposed to create a piece of killer content that ranks in the top positions of Google?<\/p>\n<p>With that in mind, this section will focus on how user intent influences the way you approach writing or creating content for your website.<\/p>\n<h2>Content Length<\/h2>\n<p>There’s lots of discussion on how long content should be, but as you’ll probably have guessed, there is no definitive answer.<\/p>\n<p>Generally, content can be broken down into two main categories: long form and short form.<\/p>\n<p>Let’s take a look at what they are as well as their advantages and disadvantages.<\/p>\n<h3>Long Form Content<\/h3>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Typically 2000 words or more.<\/li>\n<li>Intended for well researched, in-depth content.<\/li>\n<li><span style=\"color: #89b504;\">Keyword rich &#8211; allows you to seamlessly incorporate the keywords you want to target.<\/span><\/li>\n<li><span style=\"color: #89b504;\">Less Competitive &#8211; writing long form content regularly is a strenuous task.<\/span><\/li>\n<li><span style=\"color: #89b504;\">Increased Authority &#8211; publishing detailed articles that offer great value establishes you as an industry expert.<\/span><\/li>\n<li><span style=\"color: #89b504;\">Increased Backlinks &#8211; well researched articles are likely to attract more links which will bring in more traffic and improve authority.<\/span><\/li>\n<li><span style=\"color: #89b504;\">Better Conversions &#8211; users will spend more time on your website, which could lead to an increase in conversions.<\/span><\/li>\n<li><span style=\"color: #89b504;\">Better Experience &#8211; through the use of headings, long form content is easily navigable for the user to find what they’re looking for.<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Expensive and time consuming &#8211; writing a well researched long form article takes time and demands a thorough understanding of the topic.<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Less Mobile-Friendly &#8211; results in lots of scrolling for mobile users who are likely looking for quick answers.<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Inconsistency &#8211; creating great long form content on a regular basis is incredibly difficult to do.<\/span><\/li>\n<\/ul>\n<\/div>\n<h3>Short Form Content<\/h3>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Typically 1000 words or less<\/li>\n<li>Intended for quick consumption<\/li>\n<li><span style=\"color: #89b504;\">Saves Time &#8211; short form content is quicker to write and quicker to read.<\/span><\/li>\n<li><span style=\"color: #89b504;\">Mobile-Friendly &#8211; creates a better user experience for mobile users<\/span><\/li>\n<li><span style=\"color: #89b504;\">Consistency &#8211; much easier to consistently write great short form content to actively engage with your audience<\/span><\/li>\n<li><span style=\"color: #89b504;\">Virality &#8211; content that is easy to digest is more likely to be shared<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Less Depth &#8211; due to lack of detail, short form content may be considered as “lower” in quality<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Poor User Engagement &#8211; users will spend less time on your website if they see that their query isn’t being answered<\/span><\/li>\n<li><span style=\"color: #ff0000;\">Not Always Search Friendly &#8211; if your content is too short, you are less likely to rank for the keywords you want to target<\/span><\/li>\n<\/ul>\n<\/div>\n<p>When it comes to long form and short form content, we can see that there’s no clear winner.<\/p>\n<p>The main point to consider therefore, is the user’s search intent.<\/p>\n<p>Afterall, RankBrain (Google’s machine learning algorithm and the 3rd most important ranking factor) aims to provide the user with the most relevant results for their query.<\/p>\n<h2>Content Formats<\/h2>\n<p>Let’s take a look at how user intent and content length affect different types of content.<\/p>\n<h4>Articles<\/h4>\n<p>Purpose: found on news or magazine style websites to cover trending topics<br \/>\nContent Length: Short Form<br \/>\nIntent: Informational<\/p>\n<h4>Blog Posts<\/h4>\n<p>Purpose: posts that cover related topics within a site’s niche by targeting long tail keywords to attract more visitors.<br \/>\nContent Length: Short Form<br \/>\nIntent: Informational<\/p>\n<h4>Guides<\/h4>\n<p>Purpose: instructional articles that go into detail about “how to” perform a task.<br \/>\nContent Length: Long Form<br \/>\nIntent: Informational<\/p>\n<h4>Infographics<\/h4>\n<p>Purpose: commonly used to condense long form content into more engaging material that is easier to share<br \/>\nContent Length: Short Form<br \/>\nIntent: Mixed (Informational \/ Navigational)<\/p>\n<h4>Lists<\/h4>\n<p>Purpose: a type of article that is presented as a list to make it easier to follow. Commonly used for recipes and reviews.<br \/>\nContent Length: Long Form<br \/>\nIntent: Mixed (Commercial \/ Informational)<\/p>\n<h4>Maps<\/h4>\n<p>Purpose: using Google Maps functionality to make your business easier to find.<br \/>\nContent Length: Short Form<br \/>\nIntent: Navigational<\/p>\n<h4>Product Pages<\/h4>\n<p>Purpose: commonly found on eCommerce websites including detailed descriptions about a product<br \/>\nContent Length: Long Form<br \/>\nIntent: Transactional<\/p>\n<h4>Videos<\/h4>\n<p>Purpose: commonly used to condense long form content into more engaging material such as video tutorials.<br \/>\nContent Length: Short Form<br \/>\nIntent: Mixed (Informational \/ Navigational)<\/p>\n<h2 id=\"WMGC\">What Makes Good Content?<\/h2>\n<h3>Know What Your Users Want and Give it To Them<\/h3>\n<p>This is perhaps the most important factor after the obvious “write quality content”. If the content on your web page isn’t useful to the user, it’s likelihood of ranking is very low. We’ve already looked at how we can use the power of keyword grouping to find relevant queries that users are looking for in the Keyword Research module. But now, it’s about actually using those words within your content.<\/p>\n<h4>Understanding Search Behaviour<\/h4>\n<p>Remember, different users have different experiences. Users who are new to a topic will likely search for generic terms like “how to rank in google”, but more experienced or informed users may search for specific terms like “seo ranking factors”.<\/p>\n<p>By anticipating search behaviour and accounting for different types of users’ queries when creating your content by including a good mix of keyword phrases, you’re increasing your Google’s understanding of the page and that you are meeting the needs of a wider audience.<\/p>\n<h3>Content That People Want to Share<\/h3>\n<p>It’s all well and good identifying the target audience for your piece of content, but you should also think about the people that run websites within your industry or niche who can link to you.<\/p>\n<p>These are the guys who’re the most likely to share your brilliant piece of content &#8211; so impressing them is key.<\/p>\n<p>Let’s see how we can make it easier to entice your audience (and maybe even your competitors) to share your content.<\/p>\n<h4>Share Triggers<\/h4>\n<p>A <strong>share trigger<\/strong> is a psychological element within your content that encourages users to share your content.<\/p>\n<p>Let’s go over a few:<\/p>\n<p>1. <strong>Utility<\/strong> &#8211; content utility is about offering your audience practical advice or information. A perfect example of high utility content are recipes.<\/p>\n<p>2. <strong>Content Length<\/strong> &#8211; we’ve already touched on this, but the length of your content determines its likelihood of it being shared. For example, Buzzmo found that longer content is more likely to be shared because it creates a sense of “awe”.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1247\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length.png\" alt=\"\" width=\"644\" height=\"464\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length.png 644w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-56x40.png 56w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-111x80.png 111w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-42x30.png 42w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-83x60.png 83w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-33x24.png 33w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-67x48.png 67w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-25x18.png 25w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-Avg-shares-by-content-length-50x36.png 50w\" sizes=\"(max-width: 644px) 100vw, 644px\" \/>\n<p>3. <strong>Memorability<\/strong> &#8211; memorable ideas and concepts that grab the user’s attention are more likely to inspire shares.<\/p>\n<p>4. <strong>Positivity<\/strong> &#8211; people are more inclined to share positivity, so wherever possible write content that elicits a positive tone.<\/p>\n<p>5. <strong>Storytelling<\/strong> &#8211; people love a great story &#8211; whether you’re writing about a product, a service or even creating a video tutorials &#8211; a strong narrative will connect more with your audience<\/p>\n<h3>Content That&#8217;s Fresh<\/h3>\n<p>As a follow up to its Caffeine update, Google rolled out its Freshness or “fresh results” algorithm in 2011 which impacted close to 35% of the search results. Why? Because Google’s primary goal is to provide the most relevant and useful information to the user. The algorithm is “designed to give you the most up-to-date results” so that if you search for “cricket scores”, you’ll get the most recent results\/scores.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1248\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores.jpg\" alt=\"\" width=\"1047\" height=\"918\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores.jpg 1047w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-46x40.jpg 46w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-91x80.jpg 91w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-34x30.jpg 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-68x60.jpg 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-27x24.jpg 27w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-55x48.jpg 55w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-21x18.jpg 21w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/7-cricket-scores-41x36.jpg 41w\" sizes=\"(max-width: 1047px) 100vw, 1047px\" \/>\n<h4>Query Deserves Freshness<\/h4>\n<p>Google is constantly analysing small portions of the web and is constantly updating its search index as it finds undiscovered content. So, when a search query suddenly increases in popularity, Google uses Query Deserves Freshness to quickly find fresh content on that particular topic and gives it precedence in the search results.<\/p>\n<h4>Ways to Tackle Content Freshness<\/h4>\n<p>1. <strong>Create Evergreen Content<\/strong> &#8211; content that will stay relevant for a long period of time.<\/p>\n<p>2. <strong>Updating Existing Content<\/strong> &#8211; pages that were published one year ago may not be as relevant, for example the “best xbox games” will change year from year, so your article should reflect these changes too.<\/p>\n<p>3. <strong>Social Sharing<\/strong> &#8211; sharing content on your social media (which triggers more shares) will add to Google’s QDF and Freshness algorithms.<\/p>\n<p>4. <strong>Content Frequency<\/strong> &#8211; publishing content (whether it’s an article, blog post or even a video) on a regular basis will naturally add to Google’s Freshness algorithm.<\/p>\n<h3>Content That Inspires Trust<\/h3>\n<p>Users want to feel comfortable when visiting your website &#8211; they want to trust that your content will answer their query.<\/p>\n<p>In order to do this, it’s important to ensure that you build a strong reputation with your content.<\/p>\n<p>For example, eCommerce websites should have clear and satisfying customer service information that helps resolves any problems that a customer may have.<\/p>\n<p>News articles should clearly indicate who is responsible for the content as well as properly cite any sources that were used. Adding expert opinions and sources to technical articles shows users that the article is well researched and is likely to be more trustworthy.<\/p>\n<p>We’ll dive into much more detail as to how you can improve your site’s authority and trustworthiness later on in the module.<\/p>\n"},"_links":{"self":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1243"}],"collection":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules"}],"about":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/types\/module"}],"version-history":[{"count":6,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1243\/revisions"}],"predecessor-version":[{"id":1397,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1243\/revisions\/1397"}],"up":[{"embeddable":true,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/406"}],"wp:attachment":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/media?parent=1243"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}