{"id":1510,"date":"2020-08-17T18:00:38","date_gmt":"2020-08-17T17:00:38","guid":{"rendered":"https:\/\/susodigital.com\/textbook\/?post_type=module&#038;p=1510"},"modified":"2020-08-17T18:45:33","modified_gmt":"2020-08-17T17:45:33","slug":"customised-search","status":"publish","type":"module","link":"https:\/\/susodigital.com\/textbook\/module\/technical-seo\/customised-search","title":{"rendered":"Customised Search"},"featured_media":0,"parent":410,"menu_order":50,"template":"","acf":{"module_quiz":"","module_time":"16","module_difficulty":{"value":"intermediate","label":"Intermediate"},"module_short_description":"<p>Unraveling how Google customises search results.<\/p>\n","module_long_description":"<p>Learn how Google uses signals such as your location, language and device type to customise your search results.<\/p>\n","video_file":false,"video_url":"","content":"<p><em>“In the age of assistance, delivering growth starts with predicting what people want”.<\/em><\/p>\n<p>This is the title to <a href=\"https:\/\/www.thinkwithgoogle.com\/marketing-resources\/experience-design\/consumer-intent\/\" target=\"_blank\" rel=\"nofollow noopener\">an article<\/a> that Google have published on their Think With Google website. The article talks about the idea of using intent signals to predict what customers want &#8211; unlocking this mystery proves to be incredibly powerful in search too.<\/p>\n<p>Before we dive into how Google uses this for Search, let’s take a look at an example of how Google applies the same concept to a non-search related scenario.<\/p>\n<h2>Predicted Travel Intent<\/h2>\n<p>Google has a patented methodology for predicting the travel intent of a user by observing a set of user signals such as previous search history, calendar information as well as information from connected social networks. These signals are evaluated to predict the user’s travel intent for a user to travel to a specific destination.<\/p>\n<p>Essentially, Google observes and learns your behaviour, then tries to predict whether or not you plan to travel. For example, if you have an Android phone, or use Google’s Maps services for example, you’ve probably received notifications like “today’s commute will be 20 minutes longer” because of traffic.<\/p>\n<p>This is as a result of Google monitoring your daily commute and identifying the average time it&#8217;s taken you to travel from home to work.<\/p>\n<p>This idea is also reflected in Search where Google sometimes may provide customised search results to users based on either their own behaviour or the behaviour of other users who performed the same search query.<\/p>\n<h2>Determining User Intent From Query Patterns<\/h2>\n<p>One aspect of customised search is evident from another patent granted to Google in 2014 titled “<a href=\"https:\/\/patents.google.com\/patent\/US8868548B2\/en\" target=\"_blank\" rel=\"nofollow noopener\">Determining user intent from query patterns<\/a>”. Google details how it monitors user behaviour by looking at how you search as well as how your queries change over time. Then, it tries to predict what you’re looking for and actually even adjusts the search results that are displayed to you, based on this learnt behaviour.<\/p>\n<p>The patent also gives an insight into the various components that make up the Search Engine System.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1512\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent.png\" alt=\"\" width=\"1875\" height=\"2192\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent.png 1875w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-1314x1536.png 1314w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-1752x2048.png 1752w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-34x40.png 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-68x80.png 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-26x30.png 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-51x60.png 51w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-21x24.png 21w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-41x48.png 41w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-15x18.png 15w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-patent-31x36.png 31w\" sizes=\"(max-width: 1875px) 100vw, 1875px\" \/>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Indexing Engine<\/li>\n<li>Ranking Engine<\/li>\n<li>Rank Modifier Engine<\/li>\n<li>Intent Identifier<\/li>\n<\/ul>\n<\/div>\n<p>Unsurprisingly, the Intent Identifier is the key engine at play here.<\/p>\n<p>For instance, it is used to identify the intent for the search query by looking at the “manner in which an individual interacts with search results”, for example, this takes into consideration the amount of time users spend interacting with the search results, monitoring which search results are being clicked on the most using a tracking component etc.<\/p>\n<p>Once the intent has been identified, the Rank Modifier Engine can then adapt the search results, achieving a customised set of results for the user’s query.<\/p>\n<h2>Optimising Your Website for Personalised Search<\/h2>\n<p>There are countless other ways that Google is applying personalisation to search results, but going through each and every one would take a long time. The key takeaway is that customised search is a thing, and there are certain things you can do on your websites in order to optimise for this.<\/p>\n<p>Let’s take a look at a few.<\/p>\n<p>Although Google’s Danny Sullivan described the personalisation of search as being “very light”, it’s still worth understanding how you can take advantage of this on your websites.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">FYI, personalization of results is very light. Most people searching in the same language and same location will see largely the same things. Location and language are far more influential about why results differ.<\/p>\n<p>— Danny Sullivan (@dannysullivan) <a href=\"https:\/\/twitter.com\/dannysullivan\/status\/996466966083682304?ref_src=twsrc%5Etfw\">May 15, 2018<\/a><\/p><\/blockquote>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n<p>He goes on to explain that “location and language” are the two main factors that determine personalised search results.<\/p>\n<p>On top of this, another incredibly important and influential factor is whether or not you are logged into your Google account.<\/p>\n<p>If you’re logged into your Google account, Google are able to provide you with a much more personalised experience because they are able to view:<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Your location<\/li>\n<li>Your default language<\/li>\n<li>The device you’re using i.e. mobile, desktop, tablet<\/li>\n<li>Your browser and search history<\/li>\n<\/ul>\n<\/div>\n<p>Below, we’ll explore how Google uses the above factors in providing custom search results, and how you can optimise your website to enhance this.<\/p>\n<h3>Location<\/h3>\n<p>If your search query pertains to a particular place i.e. “plumbers in new york city”, it makes perfect sense that Google should display search results specifically for this location. What’s more powerful though, is Google being able to do this without you having to specify the location within the search query. If you’re in New York City, and you type “plumbers”, you should be presented with search results relevant to this location.<\/p>\n<p>Regardless of whether or not you are logged into your Google account, Google will still be able to present you with personalised results as it also uses your IP address to track your location.<\/p>\n<p>If you have location tracking enabled on your mobile device, Google will also be able to view your location history, and as we’ve seen from the travel intent patent, it tries to predict your behaviour to provide you with a personalised experience.<\/p>\n<p>Here are some suggestions on how to optimise your site for locations (these mainly apply if your content targets specific locations):<\/p>\n<h4>Google My Business<\/h4>\n<p>Ensure that you have a Google My Business listing, this is where you can include information about your business. We will explore this in much more detail later on in the course, but essentially, it’s a way of telling Google (and users) more about your business such as your name, address, phone number, email address, photos, descriptions, opening hours etc.<\/p>\n<h4>Structured Data<\/h4>\n<p>This is another technique (which we’ll explore in greater detail later on in this module), where you can help provide Google with information about the content on your website.<\/p>\n<h4>Mobile Optimisation<\/h4>\n<p>Considering that the majority of local based searches occur on mobile, it’s crucial that the mobile version of your site is well optimised so that you have the best possible chance of ranking for “near me” searches etc.<\/p>\n<h3>Language<\/h3>\n<p>Optimising your website for languages coincides with International SEO, a topic we will cover in the next module.<\/p>\n<p>International SEO is a branch of Search that can be catastrophic to your site’s rankings (and the user’s experience) if implemented incorrectly, so the utmost care needs to be taken when going ahead with this.<\/p>\n<p>There are two main approaches for this:<\/p>\n<p>1. Country Specific TLD &#8211; if your website ends in a specific country code like .co.uk (for the United Kingdom) or .ch (for China), you should ensure that your site is hosted within this country and that you specify the language and country within your hreflang tags. If you have content in multiple languages, then use subfolders like \/en\/, \/de\/ etc.<\/p>\n<p>2. Universal Website with Multiple Languages &#8211; you may wish to have a universal website (.com TLD), in this case, you should host your site within your main target market with the default language and location set to this market. Then, specify the location and language within your hreflang tags. The difference here, is that you now should use country specific subfolders (instead of language) i.e. \/uk\/, \/ch\/, \/in\/ etc.<\/p>\n<h3>Device<\/h3>\n<p>The device you use influences the search experience, this is even more important now that <a href=\"https:\/\/developers.google.com\/search\/mobile-sites\/mobile-first-indexing\" target=\"_blank\" rel=\"nofollow noopener\">mobile-first-indexing<\/a> is being used. This means that Google largely uses the mobile version of the content on your website for indexing and ranking pages.<\/p>\n<p>Certain factors such as page load speed play a huge role in whether or not a page is presented to mobile users. Therefore, it’s crucial that your pages load quickly on mobile devices &#8211; not only will this improve the user’s experience of your site, but will also enhance your chances of ranking.<\/p>\n<p>We will delve into page speed later on in this module.<\/p>\n<h3>Browser\/Search History<\/h3>\n<p>We’ve already seen this factor in play with the “Determining User Intent From Query Patterns” patent, but there’s further evidence of how Google use your browser and search history to provide personalised search results from <a href=\"http:\/\/appft.uspto.gov\/netacgi\/nph-Parser?Sect1=PTO1&amp;Sect2=HITOFF&amp;d=PG01&amp;p=1&amp;u=%2Fnetahtml%2FPTO%2Fsrchnum.html&amp;r=1&amp;f=G&amp;l=50&amp;s1=%2220120233142%22.PGNR.&amp;OS=DN\/20120233142&amp;RS=DN\/20120233142\" target=\"_blank\" rel=\"nofollow noopener\">this patent<\/a> which was published in 2012, it’s called “Personalization of Web Search Results Using Term, Category, and Link-Based User Profiles”.<\/p>\n<p>The patent outlines how your previous search behaviour helps give Google a better idea of your interests, which in turn, shapes how you experience online search.<\/p>\n<p>For example, we performed the following search in Google.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1513\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples.png\" alt=\"\" width=\"1080\" height=\"102\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples.png 1080w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-424x40.png 424w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-847x80.png 847w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-318x30.png 318w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-635x60.png 635w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-254x24.png 254w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-508x48.png 508w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-191x18.png 191w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-381x36.png 381w\" sizes=\"(max-width: 1080px) 100vw, 1080px\" \/>\n<p>Now, if we type “how to”, you can see that Google suggests similar search queries.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1514\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion.png\" alt=\"\" width=\"1112\" height=\"490\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion.png 1112w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-91x40.png 91w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-182x80.png 182w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-68x30.png 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-136x60.png 136w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-54x24.png 54w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-109x48.png 109w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-41x18.png 41w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/9-apples-suggestion-82x36.png 82w\" sizes=\"(max-width: 1112px) 100vw, 1112px\" \/>\n<p>Notably, you can see that Google has highlighted the previous search in purple.<\/p>\n<p>This is just one example of how Google adapts your search experience based on your search history.<\/p>\n<p>The way to optimise for this factor is to understand the search intent behind the keywords.<\/p>\n<p>If you have a website about gardening for example, you may have an article on how to grow apple trees which ranks well for the keyword “how to grow apples”.<\/p>\n<p>But as you can see, Google suggested a range of other possible keywords that users may be interested in based on the intent of the previous search query.<\/p>\n<p>So as a webmaster, this opens up a world of opportunities for you to target these similar search terms.<\/p>\n<p>This is just one of the reasons why we have an entire module dedicated to <a href=\"https:\/\/susodigital.com\/textbook\/module\/semantic-search\" target=\"_blank\" rel=\"nofollow noopener\">Semantic Search<\/a>.<\/p>\n<p>Despite the fact that personalisation isn’t as heavy as it used to be, we can see how factors such as the location, language, device used, in conjunction with search history, does have some influence on how Google presents the search results.<\/p>\n"},"_links":{"self":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1510"}],"collection":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules"}],"about":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/types\/module"}],"version-history":[{"count":2,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1510\/revisions"}],"predecessor-version":[{"id":1515,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1510\/revisions\/1515"}],"up":[{"embeddable":true,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/410"}],"wp:attachment":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/media?parent=1510"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}