{"id":1537,"date":"2020-08-24T18:00:53","date_gmt":"2020-08-24T17:00:53","guid":{"rendered":"https:\/\/susodigital.com\/textbook\/?post_type=module&#038;p=1537"},"modified":"2020-08-21T15:37:41","modified_gmt":"2020-08-21T14:37:41","slug":"site-speed-optimisation","status":"publish","type":"module","link":"https:\/\/susodigital.com\/textbook\/module\/advanced-technical-seo\/site-speed-optimisation","title":{"rendered":"Site Speed Optimisation"},"featured_media":0,"parent":412,"menu_order":54,"template":"","acf":{"module_quiz":"","module_time":"37","module_difficulty":{"value":"hard","label":"Hard"},"module_short_description":"<p>Learn how to optimise your site speed in a Google-friendly way.<\/p>\n","module_long_description":"<p>Site speed is a ranking factor. In this chapter you learn how Google approaches site and page speed as well as how to optimise your site's load performance in away that is Google-friendly.<\/p>\n","video_file":false,"video_url":"","content":"<p>Your website’s performance is a crucial factor when it comes to providing users with a positive experience. Site (and page) speed is one of the few signals that Google has <a href=\"https:\/\/developers.google.com\/web\/updates\/2018\/07\/search-ads-speed\" target=\"_blank\" rel=\"nofollow noopener\">confirmed<\/a> as being a ranking factor for both desktop and <a href=\"https:\/\/webmasters.googleblog.com\/2018\/01\/using-page-speed-in-mobile-search.html\" target=\"_blank\" rel=\"nofollow noopener\">mobile search<\/a>.<\/p>\n<p>Simply put, this means that a website that loads faster, will rank higher in the search results.<\/p>\n<p>In this chapter, you will understand why site speed is important and learn how to optimise your website’s load speed in a Google-friendly way.<img loading=\"lazy\" class=\"alignnone size-full wp-image-1539\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation.jpg\" alt=\"\" width=\"1426\" height=\"1006\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation.jpg 1426w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-57x40.jpg 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-113x80.jpg 113w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-43x30.jpg 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-85x60.jpg 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-34x24.jpg 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-68x48.jpg 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-26x18.jpg 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-optimisation-51x36.jpg 51w\" sizes=\"(max-width: 1426px) 100vw, 1426px\" \/><\/p>\n<h2>What is Site Speed?<\/h2>\n<p>At its most basic level site speed can be defined as the average time it takes to fully load a page as a mean average across all a website&#8217;s pages.<\/p>\n<p>Let&#8217;s unpack this statement a little further and take a closer look at what it means for a page to have been “fully” loaded.<\/p>\n<p>A fully loaded page is one where the time between a page being requested by a user and the time that all resources have been rendered on the browser. In other words, there are no more elements of the page left to load.<\/p>\n<p>Site speed is based on the moment your website begins to appear in a browser, which is known as the 90th percentile First Contentful Paint (FCP).<\/p>\n<p>This is backed up by Google’s own definition of site speed:<em>“Site speed reflects how quickly a website responds to web requests”<\/em>.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1540\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen.png\" alt=\"\" width=\"777\" height=\"536\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen.png 777w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-58x40.png 58w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-116x80.png 116w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-43x30.png 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-87x60.png 87w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-35x24.png 35w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-70x48.png 70w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-26x18.png 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-site-speed-screen-52x36.png 52w\" sizes=\"(max-width: 777px) 100vw, 777px\" \/>\n<p>The second part of our definition refers to the “average across all website pages”.<\/p>\n<p>In most cases, each web page on a website has varying amounts of unique content. As a result, some pages may have additional resources such as extra images that warrant a longer load time.<\/p>\n<p>Therefore, Google measures <em>“the speed of all the pages that make up your site based on real world data collected via the <a href=\"https:\/\/developers.google.com\/web\/tools\/chrome-user-experience-report\/\" target=\"_blank\" rel=\"nofollow noopener\">Chrome User Experience Report<\/a> (CrUX)”<\/em>.<\/p>\n<p>The CrUX is a publically available report that is updated monthly with user experience data that is sorted based on country and effective connection type.<\/p>\n<h2>Why is Site Speed Important?<\/h2>\n<p>Just like how restaurants aim to serve your food as quickly as possible so that diners have an enjoyable experience, presenting users with answers to their search queries quickly is crucial in search.<\/p>\n<p>As we mentioned before, site speed is a <a href=\"https:\/\/developers.google.com\/web\/updates\/2018\/07\/search-ads-speed\" target=\"_blank\" rel=\"nofollow noopener\">ranking factor<\/a> &#8211; a slow website does not only result in poor search engine rankings; hinder the user’s experience and result in fewer organic visits and conversion; it also increases operational costs.<\/p>\n<p>As is the case with any other ranking factors, it&#8217;s impossible to quantify its exact importance in the context of Google’s algorithm, but what is clear is that Google’s main priority is to present users with the best possible experience. This means presenting search results that offer what they’re looking for quickly as opposed to ranking a site that users will be frustrated with and click off due to slow load times.<\/p>\n<p>Let’s take a look at site speed from both Google and the user’s perspective.<\/p>\n<h3>How Speed Impacts Users<\/h3>\n<p>Modern internet users expect results to be delivered to them as quickly as possible. If a website takes too long to load, users do not have the patience to wait and will simply leave.<\/p>\n<p>This is something that is expressed in a patent granted to Google in 2014 titled “<a href=\"https:\/\/patents.google.com\/patent\/US8645362B1\/en\" target=\"_blank\" rel=\"nofollow noopener\">Using resource load times in ranking search results<\/a>”, which states <em>“Given two resources that are of similar relevance to a search query, a typical user may prefer to visit the resource having the shorter load time.”<\/em><\/p>\n<p>For users, a faster website correlates with a positive user experience, which increases the likelihood of better conversions. If a user lands on a page from the SERPs, and the page takes too long to load, then it&#8217;s highly likely that user will bounce immediately back to the SERPs and visit another web page instead.<\/p>\n<p>This is because users want immediate results for their query and they know that they can nearly always get what they want from another website. Unless your page offers something unique to everyone else, users will show no mercy in bouncing back to the search results page and then to your competition.<\/p>\n<h3>How Speed Impacts Google<\/h3>\n<p>Google confirmed that page speed plays a part during the ranking phase in the patent, explaining that “a search result for a resource having a short load time relative to resources having longer load times <u>can be promoted in a presentation order<\/u>, and search results for the resources having <u>longer load times can be demoted<\/u>”.<\/p>\n<p>However, a slow website also has implications when it comes to how Google interacts with your website during the crawling phase.<\/p>\n<p>Google only has a finite amount of time and capacity to spend time crawling, indexing and rendering a site. Therefore, if a website is too slow to load, then Google may not be able to crawl the entire website &#8211; meaning important pages may be missed before Googlebot moves onto the next website.<\/p>\n<p>This is an issue if you have a site that is either constantly growing at scale or is being updated with new content regularly as Google will simply take longer to see these changes. This will impact the rate of indexing by Google meaning that any change made on the site will not be reflected as quickly in the results.<\/p>\n<h2>What is Page Speed?<\/h2>\n<p>Often confused with site speed (which is the mean average of all pages), page speed refers to the speed of an individual page i.e. the time it takes one page to render fully on a web browser.<\/p>\n<p>There are several visual load metrics that are used to measure page speed:<\/p>\n<p>1. Fully Loaded Page: this refers to the time it takes for all resources on the web page to be rendered and displayed to the user (or user agents).<\/p>\n<p>2. Time to First Bite &#8211; this measures the time spent waiting for the initial response from the server to start loading the contents of a web page. It’s the very beginning of the loading process, where the first byted (pieces) of information are sent back to the user by the server after the request has been made.<\/p>\n<p>3. First Contentful Paint (FCP) &#8211; this measures the time taken for the web browser to render the first <a href=\"https:\/\/susodigital.com\/textbook\/module\/advanced-technical-seo\/javascript-seo#TD\" target=\"_blank\" rel=\"nofollow noopener\">DOM<\/a> element after the user navigates to your web page.<\/p>\n<p>4. First Meaningful Paint (FMP) &#8211; this measures the time taken to load enough of the web pages’ resources so that the user (or search engine bot) can read the content on the page.<\/p>\n<p>5. First Input Delay (FID) &#8211; this measures the time between the user interacting with a web page (i.e. clicking a link or tapping a button) to the time when the browser is actually able to respond to that interaction.<\/p>\n<p>6. Average Speed Index &#8211; this measures how quickly the contents of the web page is displayed to the user.<\/p>\n<p>Each of these metrics provide an insight into a page’s load speed at various stages of the user’s experience. For example, a low FID entails a fast response time and in turn tells the user that their interactions will be registered and executed quickly whereas a high TTFD results in the user having to wait a long time for the contents of a web page to load.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1542\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time.jpg\" alt=\"\" width=\"1296\" height=\"912\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time.jpg 1296w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-57x40.jpg 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-114x80.jpg 114w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-43x30.jpg 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-85x60.jpg 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-34x24.jpg 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-68x48.jpg 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-26x18.jpg 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-loading-time-51x36.jpg 51w\" sizes=\"(max-width: 1296px) 100vw, 1296px\" \/>\n<p>The above graphic from a Google <a href=\"https:\/\/www.thinkwithgoogle.com\/marketing-resources\/data-measurement\/mobile-page-speed-new-industry-benchmarks\/\" target=\"_blank\" rel=\"nofollow noopener\">study<\/a> wonderfully illustrates a user’s likelihood of leaving a web page as a result of slow load times.<\/p>\n<h2>Why is Page Speed Important?<\/h2>\n<p>Even if you have good overall site speed you will not rank well for a keyword if the web page that is targeting that keyword is slow.<\/p>\n<p>This is because Google treats each query uniquely, hoping to give the best possible answer for every unique search.<\/p>\n<p>If a website is fast overall but has a painfully slow load time for a page that perfectly matches a query searched on Google, then it will not rank as well as it could.<\/p>\n<h2>How Google Evaluates Load Times<\/h2>\n<p>The <a href=\"https:\/\/patents.google.com\/patent\/US8645362B1\/en\" target=\"_blank\" rel=\"nofollow noopener\">patent<\/a> we mentioned earlier shines some light as to how Google measures and compares the speed or two different resources as well as outlines which factors impact the load time of a web page in a browser.<\/p>\n<p>Essentially, when given two different web pages for a particular search query, Google may limit itself to testing the speeds using devices that are:<\/p>\n<p>1. In the same country<\/p>\n<p>2. Using the same user-agent (i.e. using the same web browser)<\/p>\n<p>To measure the load times of two different web pages.<\/p>\n<p>Other factors such as the user’s device, the resource that is being requested, the web server that is serving the resource as well as the network connections are also listed as factors that may contribute to variance in load times.<\/p>\n<p>The patent also takes into account how information data on load speeds for some resources may be lacking, which makes it difficult to accurately evaluate the speed. Google provides the following example: <em>“A resource in Chinese may not have enough visits from user devices located in France to generate a meaningful load time measure using solely devices from France, or a newly launched website may not have sufficient load time data associated with its resources”<\/em>.<\/p>\n<p>The bottom line however, is that if two web pages are being compared and one loads quicker than the other, the quicker result is prioritised in the search results page while the slower page is demoted.<\/p>\n<p>Therefore, although your site speed isn’t as impactful as say the relevance of a web page, it could be the deciding factor when two similarly fast (or slow) pages are pitted against each other.<\/p>\n<h4>How Google Measures Load Times<\/h4>\n<p>When it comes to measuring load times, Google uses a combination of lab data (i.e. a prediction of the theoretical speed of a web page based on Google’s own testing) and field data (i.e. from users who have tried to access the pages that were tested) &#8211; this is according to Google Webmaster Trends Analyst <a href=\"https:\/\/www.youtube.com\/watch?v=7HKYsJJrySY\" target=\"_blank\" rel=\"nofollow noopener\">John Mueller<\/a>.<\/p>\n<p>Mueller also explained how this data is similar to what is contained in the Chrome User Experience Report (CrUX report).<\/p>\n<p>Although there is no “ideal” page speed that Google is looking for, it has provided some thresholds for users to aim for:<\/p>\n<p>Fast: 0 &#8211; 1 second<br \/>\nAverage: 1 second &#8211; 2.5 seconds<br \/>\nSlow: 2.5 seconds and up<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1543\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times.jpg\" alt=\"\" width=\"1426\" height=\"1006\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times.jpg 1426w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-57x40.jpg 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-113x80.jpg 113w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-43x30.jpg 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-85x60.jpg 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-34x24.jpg 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-68x48.jpg 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-26x18.jpg 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-load-times-51x36.jpg 51w\" sizes=\"(max-width: 1426px) 100vw, 1426px\" \/>\n<p>Google also recommends that the average speed index is less than 3 seconds and the time to first byte should be <a href=\"https:\/\/developers.google.com\/speed\/docs\/insights\/Server\" target=\"_blank\" rel=\"nofollow noopener\">no more than 200 milliseconds<\/a>.<\/p>\n<h2>Measuring Site Speed and Page Speed<\/h2>\n<p>As we’ve seen, there are several different ways to measure the performance of your website and web pages. There’s no definitive metric that trumps the others as you may end up improving on some metrics while comprising others.<\/p>\n<p>Instead the focus should be on improving the load speeds across all metrics.<\/p>\n<h3>How to Measure Site Speed<\/h3>\n<p>Measuring site speed is often overlooked and misconstrued by SEOs who direct marketers to tools that actually page speed. You can monitor your site speed performance on Google Analytics by navigating to:<\/p>\n<p>Behaviour &gt; Site Speed &gt; Overview<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1544\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed.png\" alt=\"\" width=\"1906\" height=\"743\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed.png 1906w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-1536x599.png 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-103x40.png 103w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-205x80.png 205w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-77x30.png 77w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-154x60.png 154w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-62x24.png 62w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-123x48.png 123w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-46x18.png 46w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-google-analytics-site-speed-92x36.png 92w\" sizes=\"(max-width: 1906px) 100vw, 1906px\" \/>\n<p>Here, Google provides an accurate measurement of various metrics pertaining to the average load speeds of your website (i.e. your site speed) over time.<\/p>\n<p>The main metric that is of interest, is the <u>Avg. Page Load Time<\/u>.<\/p>\n<p>This metric measures the full time it takes on average to render a web page on your website. It’s worth emphasising that this is indeed an average measure and that the individual page load time will vary significantly depending on their content.<\/p>\n<p>Remember, some web pages are more resource-heavy than others.<\/p>\n<p>If you navigate to:<\/p>\n<p>Behaviour &gt; Site Speed &gt; Page Timings<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1545\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings.png\" alt=\"\" width=\"1900\" height=\"670\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings.png 1900w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-1536x542.png 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-113x40.png 113w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-227x80.png 227w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-85x30.png 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-170x60.png 170w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-68x24.png 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-136x48.png 136w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-51x18.png 51w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-timings-102x36.png 102w\" sizes=\"(max-width: 1900px) 100vw, 1900px\" \/>\n<p>You can view the timings on a page level, allowing you to identify pages that loaded slower than the average page load time of your website.<\/p>\n<p>Google also provides specific suggestions on how to improve the load times for each page.<\/p>\n<p>To view the suggestions, navigate to:<\/p>\n<p>Behaviour &gt; Site Speed &gt; Speed Suggestions<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1546\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions.png\" alt=\"\" width=\"1887\" height=\"753\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions.png 1887w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-1536x613.png 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-100x40.png 100w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-200x80.png 200w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-75x30.png 75w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-150x60.png 150w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-60x24.png 60w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-120x48.png 120w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-45x18.png 45w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-suggestions-90x36.png 90w\" sizes=\"(max-width: 1887px) 100vw, 1887px\" \/>\n<h3>How to Measure Page Speed<\/h3>\n<p>As we mentioned before, there is a variety of third party tools available for measuring individual page speeds including crawlers like <a href=\"https:\/\/sitebulb.com\/\" target=\"_blank\" rel=\"nofollow noopener\">Sitebulb<\/a> as well as websites like <a href=\"https:\/\/gtmetrix.com\/\" target=\"_blank\" rel=\"nofollow noopener\">GTMetrix<\/a> and <a href=\"https:\/\/tools.pingdom.com\/\" target=\"_blank\" rel=\"nofollow noopener\">Pingdom<\/a> both of which offer detailed suggestions on how to improve your page speed.<\/p>\n<p>Google also has its own tool called: <a href=\"https:\/\/developers.google.com\/speed\/pagespeed\/insights\/\" target=\"_blank\" rel=\"nofollow noopener\">PageSpeed Insights<\/a> which allows you to test the performance of a web page on both mobile and desktop.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1547\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights.png\" alt=\"\" width=\"1805\" height=\"765\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights.png 1805w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-1536x651.png 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-94x40.png 94w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-189x80.png 189w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-71x30.png 71w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-142x60.png 142w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-57x24.png 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-113x48.png 113w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-42x18.png 42w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-page-speeds-insights-85x36.png 85w\" sizes=\"(max-width: 1805px) 100vw, 1805px\" \/>\n<p>The PageSpeed Insights tool provides a performance score based upon how well a web page meets a number of <a href=\"https:\/\/developers.google.com\/speed\/docs\/insights\/rules\" target=\"_blank\" rel=\"nofollow noopener\">rules<\/a> that are set by Google.<\/p>\n<p>It&#8217;s good practice to use all of them as each have their own unique data points of focus that can provide useful information for improving overall performance.<\/p>\n<h2>Best Practices for Page Speed<\/h2>\n<p>It’s now time to turn the theory into practice.<\/p>\n<p>Below we have highlighted the best practices for improving your website’s loading times.<\/p>\n<h3>Server Side Recommendations<\/h3>\n<h4>Improving Server Load Times<\/h4>\n<p>As you may remember from Physics 101:<\/p>\n<pre>Speed = Distance \/ Time<\/pre>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1548\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula.jpg\" alt=\"\" width=\"1426\" height=\"1006\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula.jpg 1426w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-57x40.jpg 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-113x80.jpg 113w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-43x30.jpg 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-85x60.jpg 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-34x24.jpg 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-68x48.jpg 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-26x18.jpg 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-speed-formula-51x36.jpg 51w\" sizes=\"(max-width: 1426px) 100vw, 1426px\" \/>\n<p>In order to improve speed, these variables need to be considered and adjusted accordingly.<\/p>\n<p>Now that electric signals can travel near the speed of light, it&#8217;s very difficult for us to improve on this!<\/p>\n<p>However, distance is something we can control. All other variables being equal, a computer based in the United States should connect and receive information quicker from a Canadian based server as opposed to a UK based server. This reflects the examples Google provided in their patent for comparing page load times.<\/p>\n<p>Based on this, it makes sense to have your website hosted on a server that is closest to your main target audience.<\/p>\n<p>If you have an international audience, then a CDN (content delivery network) like Cloudflare is recommended however more on this in the CDN chapter later on in this module.<\/p>\n<p>Other ways to minimise your server response time include:<br \/>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Identifying any slow database queries<\/li>\n<li>Identifying slow routing<\/li>\n<li>Lack of adequate memory (i.e. your server is unable to handle certain data requests)<\/li>\n<\/ul>\n<\/div><\/p>\n<h4>Reduce Server Requests<\/h4>\n<p>There is a maximum capacity of output before a server begins to compromise its performance. If a web server is being sent too many HTTP requests and\/or needs to load and return data that is larger in size than it can handle, it will either dramatically slow down or crash. As a result, minimising the number of server requests that the client makes to the server is an important step to take in improving load times.<\/p>\n<p>This is a common issue with website themes which load several CSS and JavaScript files which require additional HTTP requests to fetch and execute the code. The number of requests can quickly add up if you consider that these themes add additional CSS and JS files as a result of any plugins that you may have installed on top of your own files.<\/p>\n<p>In order to solve this, you should:<br \/>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Merge JavaScript files into a single file where appropriate.<\/li>\n<li>Merge CSS files into a single file where appropriate.<\/li>\n<li>Try to minimise the number of plugins that load their own external JavaScript and\/or CSS files.<\/li>\n<li>Use sprites for images that are used frequently i.e. your logo.<\/li>\n<li>Reduce the number of <a href=\"https:\/\/susodigital.com\/textbook\/module\/technical-seo\/mastering-crawl#301\" target=\"_blank\" rel=\"nofollow noopener\">301 redirects<\/a> where appropriate. Every time one page redirects to another page, a new HTTP request is made to the server.<\/li>\n<\/ul>\n<\/div><\/p>\n<h4>Server Configuration<\/h4>\n<p>The configuration of your web server is another factor that affects your website’s performance.<\/p>\n<p>Most content management systems (CMS) are based on a PHP framework that is then converted in the HTML. How efficiently the server executes this framework will impact the overall speed performance of this site. This is why different hosting providers advertise their platform as being friendly for WordPress, Magento etc.<\/p>\n<p>When it comes to hosting, using a budget hosting provider is not recommended. This is because you will likely be sharing the same web server as countless other websites which all but guarantees that loading times will be nowhere near as fast as you would like.<\/p>\n<p>There are hundreds of web hosting providers so it’s difficult to recommend just one. However, the main takeaway here, is to consider upgrading to a premium host or if possible, a dedicated server.<\/p>\n<h3>Site Wide Recommendations<\/h3>\n<h4>Browser Caching<\/h4>\n<p>Caching refers to the storing of information locally (i.e your browser) in order to help speed up the reloading of an asset like a web page.<\/p>\n<p>For websites, browser caching can be set in the htaccess file and can include instructions on caching different types of content like images, stylesheets, JavaScript, videos and more.<\/p>\n<p>Caching improves performance as when a visitor returns to your website, the browser no longer has to reload the entire page as it has already stored some of the assets from the web page.<\/p>\n<p>You can find more information on how to implement and leverage browser caching from Google <a href=\"https:\/\/developers.google.com\/speed\/docs\/insights\/LeverageBrowserCaching?csw=1\" target=\"_blank\" rel=\"nofollow noopener\">here<\/a>.<\/p>\n<h4>Theme<\/h4>\n<p>If you are using a CMS (content management system) that provides themes like WordPress, or Bigcommerce we recommend that you conduct some research on what themes have been tested to have the best speed performance for that platform.<\/p>\n<h3>Page Level Recommendations<\/h3>\n<h4>Remove Render Blocking JS and CSS<\/h4>\n<p>The source code for a web page should be constructed in the following order:<\/p>\n<p>1. HTML<\/p>\n<p>2. CSS<\/p>\n<p>3. JavaScript<\/p>\n<p>This is because Google is able to render HTML and CSS quickly, but is slow to render Javascript code.<\/p>\n<p>In fact the default version of Googlebot is unable to render Javascript properly and when it discovers JavaScript code it requests another specialised bot to render the scripts.<\/p>\n<p>With that in mind, you should ensure that any CSS and external JavaScript are kept below the HTML code. This is because these scripts must be fetched before they can be executed &#8211; in other words, they “block” the bot from rendering anything else.<\/p>\n<p>Use Google’s <a href=\"https:\/\/developers.google.com\/speed\/pagespeed\/insights\/\" target=\"_blank\" rel=\"nofollow noopener\">PageSpeed Insights<\/a> tool to identify which JavaScript files are blocking the rendering process.<\/p>\n<p>To avoid render-blocking JavaScript, Google recommends inlining scripts to avoid additional network requests.<\/p>\n<p>For example, if you had an HTML page that references an external JS file “file.js” like so:<\/p>\n<pre>&lt;html&gt;\r\n  &lt;head&gt;\r\n    &lt;script src=\"small.js\"&gt;&lt;\/script&gt;\r\n  &lt;\/head&gt;\r\n  &lt;body&gt;\r\n    &lt;div&gt;\r\n      Hello, world!\r\n    &lt;\/div&gt;\r\n  &lt;\/body&gt;\r\n&lt;\/html&gt;<\/pre>\n<p>You can inline the script within the HTML itself:<\/p>\n<pre>&lt;html&gt;\r\n  &lt;head&gt;\r\n    &lt;script&gt;\r\n      \/* contents of a small JavaScript file *\/\r\n    &lt;\/script&gt;\r\n  &lt;\/head&gt;\r\n  &lt;body&gt;\r\n    &lt;div&gt;\r\n      Hello, world!\r\n    &lt;\/div&gt;\r\n  &lt;\/body&gt;\r\n&lt;\/html&gt;<\/pre>\n<p>This prevents additional server requests being made to fetch and execute the JavaScript.<\/p>\n<p>Note that this is effective for small JS files.<\/p>\n<p>In addition, if CSS or JS code is not needed for a particular page, then it should be removed, made asynchronous or deferred until after the first render to minimise the load times. This is a common issue with some themes\/CMS that replicate scripts across all pages when it is not needed.<\/p>\n<p>You can find more information about removing render-blocking JavaScript <a href=\"https:\/\/developers.google.com\/speed\/docs\/insights\/BlockingJS\" target=\"_blank\" rel=\"nofollow noopener\">here<\/a>.<\/p>\n<h4>Compress and Minify Resources<\/h4>\n<p>Apart from render-blocking, compressing and minifying resources such as stylesheets and JavaScript files can drastically improve load times.<\/p>\n<p>Both CSS and JS can have hundreds if not thousands of lines of code &#8211; most of which may not be necessary at all.<\/p>\n<p>Every single character from spaces and commas to line breaks and comments increases the size of your files.<\/p>\n<p>Whilst well formatted and commented code makes it easier for humans to understand, it makes no difference to the web server and compiler that executes and runs the code.<\/p>\n<p>Therefore, removing such redundant code can help improve your site’s performance.<\/p>\n<p>Here are some tips on how to minify your resources:<br \/>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Use shorter names for functions and variables<\/li>\n<li>Remove comments<\/li>\n<li>Remove unnecessary spacing<\/li>\n<\/ul>\n<\/div><\/p>\n<p>There are several tools available that can help speed up the process for you.<br \/>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>For HTML &#8211; use <a href=\"https:\/\/github.com\/kangax\/html-minifier\" target=\"_blank\" rel=\"nofollow noopener\">HTMLMinifier<\/a><\/li>\n<li>For CSS &#8211; use <a href=\"https:\/\/github.com\/ben-eb\/cssnano\" target=\"_blank\" rel=\"nofollow noopener\">CSSNano<\/a> and <a href=\"https:\/\/github.com\/css\/csso\" target=\"_blank\" rel=\"nofollow noopener\">csso<\/a>.<\/li>\n<li>For JavaScript &#8211; use <a href=\"https:\/\/github.com\/mishoo\/UglifyJS2\" target=\"_blank\" rel=\"nofollow noopener\">UglifyJS<\/a><\/li>\n<\/ul>\n<\/div><\/p>\n<p>Once you have minified your code, you should also compress it using <a href=\"https:\/\/www.gnu.org\/software\/gzip\/\" target=\"_blank\" rel=\"nofollow noopener\">GZip<\/a>.<\/p>\n<h4>Image Optimisation<\/h4>\n<p>Images are a common culprit when it comes to slowing down page load times.There are steps however that can be performed to help improve the speed for pages that are image-heavy.<\/p>\n<p><u>Compression<\/u><\/p>\n<p>The raw data size of images should be as small as possible so that the server spends less time loading. Images should be compressed as much as possible before uploading to your website. Remember that big files correlate with increased higher definition images.<\/p>\n<p>In cases where the image quality is important, we recommend using <strong><dfn title=\"Lossless compression is a method of compression that allows the original image to be perfectly reconstructed from the compressed version.\">lossless compression<\/dfn><\/strong>.<\/p>\n<p>However, if image quality is not an important factor to the page then <strong><dfn title=\"Unlike lossless compression, lossy compression permits reconstruction only of an approximation of the original image.\">lossy compression<\/dfn><\/strong> can be used.<\/p>\n<p>There are a number of WordPress plugins available that automatically compress the images that you upload, we recommend: <a href=\"https:\/\/wp-rocket.me\/\" target=\"_blank\" rel=\"nofollow noopener\">WordPress Rocket<\/a>.<\/p>\n<p>For Non WP websites, there are several third party tools that you can use such as <a href=\"https:\/\/tinypng.com\/\" target=\"_blank\" rel=\"nofollow noopener\">TinyPNG<\/a>. We also recommend using <a href=\"https:\/\/www.photoshop.com\/en\" target=\"_blank\" rel=\"nofollow noopener\">Photoshop<\/a> for image compression to ensure that you maintain image quality too.<\/p>\n<p><u>Image Size<\/u><\/p>\n<p>Use appropriate image sizes across your web pages.<\/p>\n<p>If for example you display an image on your website that is 500 pixels wide, using a 2000 pixel wide image offers no benefits.<\/p>\n<p><u>Lazy Loading<\/u><\/p>\n<p>Lazy loading is a technique used to defer the loading of resources that are not critical during the loading process. Instead, these non-critical resources are only loaded when they are needed.<\/p>\n<p>This technique is especially useful for mobile pages where you do not want to load images or videos that are not currently displayed on the user’s screen &#8211; especially when you consider that users tend to start at the top when landing on a given web page and may even leave before reaching the bottom.<\/p>\n<p>An example of lazy loading is present on the content publishing website Medium.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-1559\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading.jpg\" alt=\"\" width=\"1624\" height=\"1000\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading.jpg 1624w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-1536x946.jpg 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-65x40.jpg 65w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-130x80.jpg 130w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-49x30.jpg 49w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-97x60.jpg 97w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-39x24.jpg 39w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-78x48.jpg 78w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-29x18.jpg 29w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/08\/10-lazy-loading-58x36.jpg 58w\" sizes=\"(max-width: 1624px) 100vw, 1624px\" \/>\n<p>Medium initially loads placeholder images which are then replaced by lazy-loaded images as the user scrolls down the page in the viewport.<\/p>\n<p>You can find information about implementing lazy loading <a href=\"https:\/\/developers.google.com\/web\/fundamentals\/performance\/lazy-loading-guidance\/images-and-video\" target=\"_blank\" rel=\"nofollow noopener\">here<\/a>.<\/p>\n"},"_links":{"self":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1537"}],"collection":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules"}],"about":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/types\/module"}],"version-history":[{"count":7,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1537\/revisions"}],"predecessor-version":[{"id":1656,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/1537\/revisions\/1656"}],"up":[{"embeddable":true,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/412"}],"wp:attachment":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/media?parent=1537"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}