{"id":2008,"date":"2020-09-21T18:00:19","date_gmt":"2020-09-21T17:00:19","guid":{"rendered":"https:\/\/susodigital.com\/textbook\/?post_type=module&#038;p=2008"},"modified":"2020-09-21T10:25:27","modified_gmt":"2020-09-21T09:25:27","slug":"the-fundamentals-of-cro","status":"publish","type":"module","link":"https:\/\/susodigital.com\/textbook\/module\/conversion-rate-optimisation\/the-fundamentals-of-cro","title":{"rendered":"The Fundamentals of CRO"},"featured_media":0,"parent":417,"menu_order":81,"template":"","acf":{"module_quiz":"","module_time":"13","module_difficulty":{"value":"easy","label":"Easy"},"module_short_description":"<p>Understanding the importance of optimising your website for improved conversions.<\/p>\n","module_long_description":"<p>We begin by highlighting the importance of optimising your website for conversions so that you can turn organic visits into paying customers.<\/p>\n","video_file":false,"video_url":"","content":"<h2>What is CRO?<\/h2>\n<p>Conversion Rate Optimisation (CRO) is the process of transforming organic website visitors into “customers” who perform a <dfn> call to action<\/dfn>: this can be filling out a form, clicking to “subscribe” or more commonly, making a purchase.<\/p>\n<p>In order to effectively optimise your website for improved <dfn title=\"a conversion is the general term for when a visitor completes a site's desired action or goal.\"> conversions <\/dfn>, you need to understand your user’s journey &#8211; how they move through the site, what specific actions they take, identify barriers that prevent them from completing your goals etc.<\/p>\n<h3>Hierarchy of Conversion<\/h3>\n<p>The Hierarchy of Conversion by the Eisenberg brothers is a great model which clearly illustrates the user&#8217;s journey by pinning the focus on persuading potential buyers to convert.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-2010\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14_hierachy_of-_cro.png\" alt=\"\" width=\"5401\" height=\"3800\" \/>\n<p>The pyramid shows that potential buyers can only move up to the next level, once the base layer has been satisfied.<\/p>\n<p>Let’s break down what each of the different levels of the pyramid represents:<\/p>\n<p><strong>Functional<\/strong>: Ensure that any technical issues with the website are fixed first and that the web pages satisfy the needs of the intended user.<\/p>\n<p><strong>Accessible<\/strong>: Is the website accessible for all users and devices? Are there any potential barriers that prevent certain individuals from using your website? Here is a <a href=\"https:\/\/a11yproject.com\/checklist\/\">great checklist<\/a> that you can use to determine how accessible your website is. Some key factors to consider are mobile users, tablet users, font sizes, contrast between buttons etc.<\/p>\n<p><strong>Usable<\/strong>: Ensure that the website is easy to use. Are important pieces of information easy to find? Do pages load quickly with little to no lag (i.e. do your page’s meet <a href=\"https:\/\/developers.google.com\/speed\/pagespeed\/insights\/\">Google’s Page Speed<\/a> requirements?).<\/p>\n<p><strong>Intuitive<\/strong>: Does the sales journey match the thought process of the user? Remove any potential barriers that may prevent a smooth and logical user journey during the buying process.<\/p>\n<p><strong>Persuasive<\/strong>: Does your site communicate that you offer what the end user is looking for and that it will solve their problem?<\/p>\n<p>Each level of the hierarchy aims to serve the user’s needs at different stages in the buying process, so it’s important to only move up to the next level, once the previous level has been achieved.<\/p>\n<h2>Measuring Conversions<\/h2>\n<p>From <strong>macro-conversions<\/strong> like purchasing a product or subscribing to a newsletter or service to <strong>micro-conversions<\/strong> like registering an account or adding a product to the cart, it’s important to be able to accurately measure the conversions to your website.<\/p>\n<p>The is the number of times a user completes a goal divided by the number of organic visits your website gets.<\/p>\n<img loading=\"lazy\" class=\"alignnone size-full wp-image-2014\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula.png\" alt=\"\" width=\"5401\" height=\"3801\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula.png 5401w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-1536x1081.png 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-2048x1441.png 2048w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-1920x1351.png 1920w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-57x40.png 57w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-114x80.png 114w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-43x30.png 43w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-85x60.png 85w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-34x24.png 34w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-68x48.png 68w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-26x18.png 26w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/09\/14-09-2020-M-14_Measuring-Conversion-formula-51x36.png 51w\" sizes=\"(max-width: 5401px) 100vw, 5401px\" \/>\n<p>Let’s go through a simple example.<\/p>\n<p>Say we have an eCommerce website that sells books.<\/p>\n<p>Take the following scenario where a user makes four separate visits to the website.<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Session 1: No conversion — user was browsing.<\/li>\n<li>Session 2: User added several books to their shopping cart, but did not make a purchase. Remember, even though no purchase was made, this still counts as a conversion!<\/li>\n<li>Session 3: User came back and decided to go ahead with the purchase. Another conversion!<\/li>\n<li>Session 4: User returns after finishing the books they bought last time, but doesn’t find anything they like.<\/li>\n<\/ul>\n<\/div>\n<p>In this case, we have 2 conversions out of 4 sessions, so the conversion rate is 50%.<\/p>\n<p>To calculate the overall conversion rate for the site, we would take the total number of conversions and divide that by the total number of organic visits to the site.<\/p>\n<p>But what about conversions where the user can only “convert” once?<\/p>\n<p>Our online book store also has a newsletter that users can subscribe to for great offers!<\/p>\n<p>Let’s look at a user subscribing to the newsletter.<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Session 1: User browses the site for books.<\/li>\n<li>Session 2: User subscribes to the monthly newsletter &#8211; this is our conversion!<\/li>\n<li>Session 3: User came back to browse more books based on the special offers from the latest newsletter.<\/li>\n<\/ul>\n<\/div>\n<p>Since the user can only convert once, we need to focus on the number of visitors as opposed to the number of sessions.<\/p>\n<p>In this case, our conversion rate is 100% &#8211; we have 1 visitor, who subscribed to the newsletter.<\/p>\n<p>To calculate the overall conversion rate for the site, we would take the total number of conversions and divide that by the total number of unique visitors to the site.<\/p>\n<h3>What Factors Influence Conversion Rate?<\/h3>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Relevance of the offer &#8211; make sure you are targeting the right audience<\/li>\n<li>Relationship with the visitor &#8211; if the visitor knows and trusts you already, they will be more likely to convert.<\/li>\n<li>Business vertical &#8211; identify which products or services are more important and focus on them.<\/li>\n<li>Cost of the product &#8211; more expensive products tend to have a lower conversion rate.<\/li>\n<li>Cost\/Value Ratio &#8211; what’s the perceived value of your offer compared to the cost?<\/li>\n<li>Content &#8211; is it persuasive? Is it clear? Does it remove any friction that the user may have?<\/li>\n<li>Design &amp; UX &#8211; is it persuasive? Is it clear? Does it remove any friction that the user may have?<\/li>\n<\/ul>\n<\/div>\n<h3>Other Engagement Metrics<\/h3>\n<p>In order to truly grasp how users are engaging with your website, it’s important to also look at the following metrics:<\/p>\n<p><strong>Bounce Rate<\/strong> &#8211; the percentage of visitors who leave after viewing a single page. A high bounce rate indicates that users are likely not finding what they’re looking for on your website.<\/p>\n<p><strong>Exit Rate<\/strong> &#8211; this is the percentage of people who leave after viewing a page. The exit rate also tells you the last page that a user visited before they left your website. A high exit rate is another red flag.<\/p>\n<p><strong>Average Time on Site<\/strong> &#8211; this tells you how long visitors are staying on your website. If you have a high bounce rate, your average time on site will be low &#8211; this is because users aren’t sticking around long enough on your website.<\/p>\n<p><strong>Average Page Views<\/strong> &#8211; the number of pages the average user visits before leaving your website. A high page view can be both good (better engagement &#8211; users are spending more time on your website) and bad (less clarity &#8211; users aren’t finding exactly what they want).<\/p>\n<h2>How CRO Benefits SEO<\/h2>\n<p>Although CRO does not directly impact the number of organic visits to your website or the ranking for a particular keyword in the SERPs, it still has many benefits for SEO.<\/p>\n<p><strong>Improved Customer Insights<\/strong> &#8211; CRO allows you to gain useful insights into your target audience. You are able to better understand how users interact with your website and in turn, adopt the content and layout of your core landing pages to align with their needs.<\/p>\n<p><strong>Improved ROI<\/strong> &#8211; an improvement in conversions will naturally mean better ROI (return on investment) for your business, this is because you’ll be able to get more conversions without having to actively seek new potential customers.<\/p>\n<p><strong>Indirect Scalability<\/strong> &#8211; whilst CRO doesn’t increase the number of visitors to your website, by converting browsers into buyers, you’re allowing your business to grow without having to run out of potential customers.<\/p>\n<p><strong>Building Trust<\/strong> &#8211; we already know that Google places a lot of emphasis on a website’s ability to inspire trust within their users &#8211; CRO is another key to unlocking a user’s trust. Users will likely only be prepared to share sensitive information such as their credit card details, email address etc if they feel that they can trust you, and if your website answers any questions they may have.<\/p>\n<p><strong>Better User Experience<\/strong> &#8211; users are likely to spend more time on websites that provide a great user experience, this means more chances of converting. The idea of CRO is to study how users interact with your website and identify roadblocks that may hinder their experience and prevent them from converting.<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n<p>&nbsp;<\/p>\n"},"_links":{"self":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/2008"}],"collection":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules"}],"about":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/types\/module"}],"version-history":[{"count":4,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/2008\/revisions"}],"predecessor-version":[{"id":2083,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/2008\/revisions\/2083"}],"up":[{"embeddable":true,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/417"}],"wp:attachment":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/media?parent=2008"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}