{"id":867,"date":"2020-07-13T20:44:36","date_gmt":"2020-07-13T19:44:36","guid":{"rendered":"https:\/\/susodigital.com\/textbook\/?post_type=module&#038;p=867"},"modified":"2020-07-13T20:44:36","modified_gmt":"2020-07-13T19:44:36","slug":"core-components","status":"publish","type":"module","link":"https:\/\/susodigital.com\/textbook\/module\/what-is-seo\/core-components","title":{"rendered":"Core Components of SEO"},"featured_media":0,"parent":391,"menu_order":20,"template":"","acf":{"module_quiz":"","module_time":"20","module_difficulty":{"value":"easy","label":"Easy"},"module_short_description":"<p>Outlining the three core components of SEO: Technical, On-Page and Off-Page.<\/p>\n","module_long_description":"<p>Understanding the importance of each component of SEO is crucial. In this chapter, we outline how each of these three components directly relate to how Google processes and organises websites for ranking.<\/p>\n","video_file":false,"video_url":"","content":"<div class=\"font-size-20 c-mt-6\"><p>As SEO professionals, our job is to try to play and win the game of crawling, indexing and ranking. In this chapter, we will look at the core components of SEO and highlight why each one of them is important. A word of truth for the modern SEO: SEO today means that we are not getting away with hacks or loopholes anymore. Exploiting specific ranking factors or components may have worked for many in the past, but the sophistication of Google’s algorithm updates have continually closed these gaps.<\/p>\n<\/div>\n<p>That is not to say that you cannot be smart in your SEO, but it is crucial to understand that we will have to optimise all components of SEO if we want to be successful.<\/p>\n<p>The three main components of SEO are:<\/p>\n<ol>\n<li>Technical SEO<\/li>\n<li>On-page SEO (or Content SEO)<\/li>\n<li>Off-page SEO (or Links)<\/li>\n<\/ol>\n<h2>The Holy Trinity: Technical, Content and Links<\/h2>\n<p>Each of these three components directly relates to how Google processes and organises websites to determine their ability to rank for search queries.<\/p>\n<img loading=\"lazy\" class=\"aligncenter size-full wp-image-868\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links.jpg\" alt=\"The Holy Trinity: Technical, Content and Links\" width=\"1746\" height=\"1395\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links.jpg 1746w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-1536x1227.jpg 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-50x40.jpg 50w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-100x80.jpg 100w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-38x30.jpg 38w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-75x60.jpg 75w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-30x24.jpg 30w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-60x48.jpg 60w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-23x18.jpg 23w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/The-Holy-Trinity-Technical-Content-and-Links-45x36.jpg 45w\" sizes=\"(max-width: 1746px) 100vw, 1746px\" \/>\n<h3>Why Does Google Look At Technical SEO?<\/h3>\n<p>Technical SEO encompasses issues that relate to the website infrastructure, clustering and categorization, internal links, page speed and sitemaps, etc. These factors directly relate to Google’s capabilities to crawl your website.<\/p>\n<p>There is no way around a fast, well-structured and mobile-friendly website if you want to be successful in the search. We have studied this in-depth in our module <a href=\"https:\/\/susodigital.com\/textbook\/module\/how-google-works\">How Google Works<\/a>. The bottom line is: you want to make it easy for Google to crawl and understand your website.<\/p>\n<div class=\"tip d-flex align-items-center bg-suso-white\"><svg class=\"tip__icon d-block text-dark-blue line-height-1-5\" enable-background=\"new 0 0 29 37\" viewBox=\"0 0 29 37\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\"><g fill=\"#18217e\" opacity=\".5\"><path d=\"m28.6 26.2-2-3.2c-.2-.3-.3-.7-.3-1l-.7-10.6c-.4-5.7-4.8-10.2-10.5-10.7-6.1-.3-11.3 4.3-11.7 10.4l-.7 10.9c0 .4-.1.7-.3 1l-2 3.1c-.4.7-.5 1.5-.1 2.3.4.7 1.1 1.2 1.9 1.2h24.5c.8 0 1.6-.4 1.9-1.1.4-.8.4-1.6 0-2.3z\"\/><path d=\"m17 31.8c.5 0 1 .3 1.3.7.3.5.3 1 0 1.5-.8 1.4-2.3 2.2-3.8 2.2s-3-.8-3.8-2.2c-.3-.5-.3-1 0-1.5s.7-.7 1.3-.7z\"\/><\/g><\/svg><div class=\"entry-content\">You want to make it easy for Google to crawl and understand your website.<\/div><\/div>\n<h3>Why Does Google Look At On-Page SEO?<\/h3>\n<p>Content is the foundation of your website, after all. As a rule of thumb: if you have not written about a topic on your website, Google will not know to index and rank you for it. Remember, Google is a text-based web crawler.<\/p>\n<p>Thus, content is what builds relevance and allows you to be found in the Google index. Creating comprehensive answers to search queries is the art and science of content creation for SEO.<\/p>\n<p>On-page SEO or keyword optimisation is the process of fine-tuning a good piece of content for the Google algorithm. It is called on-page SEO because it is happening ON your website where you are in charge and able to make all of the required changes.<\/p>\n<h3>Why Does Google Look At Off-Page SEO?<\/h3>\n<p>The opposite is what is often referred to as Off-page SEO. This is SEO that is NOT happening on your website. What SEO’s generally mean when they refer to Off-page SEO is link acquisition.<\/p>\n<p>Off-page SEO is about Google’s perception of your website’s authority which is primarily achieved through backlink building. It is third-party websites linking to your content and thus increasing your authority and rankings.<\/p>\n<p>The way Google’s algorithm approached link building is what set it apart from other search engines like Bing or Yahoo during the infancy of SEO. It’s what ensured that their search results were much better and more precise.<\/p>\n<p>Backlinks are still a crucial ranking factor. But do not underestimate the power of good content and on-page SEO! Google’s understanding of topics, context, search intent and keywords has grown dramatically. Content can be the brake or accelerator of your ranking success. Building links that point to a piece of poorly written content is no longer an effective strategy.<\/p>\n<p>To prove the point that all components matter, here is a sneak preview on important ranking factors and how they correlate with ranking on page 1 (based on the study done by <a href=\"https:\/\/backlinko.com\/search-engine-ranking\" target=\"_blank\" rel=\"noopener nofollow\">Brian Dean<\/a> or an updated study from 2019 by <a href=\"https:\/\/www.authorityhacker.com\/million-serps-analyzed\/\" target=\"_blank\" rel=\"noopener nofollow\">Authority Hacker<\/a>).<\/p>\n<p>The below graph depicts the correlation between topic coverage against the top Google search positions.<\/p>\n<blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"juBcNvi\"><p>&nbsp;<\/p><\/blockquote>\n<p><script async src=\"\/\/s.imgur.com\/min\/embed.js\" charset=\"utf-8\"><\/script><\/p>\n<p>The below graph depicts the correlation between the number of referring domains against the top Google search positions.<\/p>\n<blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"86rtu9q\"><p>&nbsp;<\/p><\/blockquote>\n<p><script async src=\"\/\/s.imgur.com\/min\/embed.js\" charset=\"utf-8\"><\/script><\/p>\n<p>The below graph depicts the correlation between inserting an exact match keyword within the page title against the top Google search positions.<\/p>\n<blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"yU57W21\"><p>&nbsp;<\/p><\/blockquote>\n<p><script async src=\"\/\/s.imgur.com\/min\/embed.js\" charset=\"utf-8\"><\/script><\/p>\n<p>As you can see, success comes from all three components of SEO.<\/p>\n<p>Let’s take a closer look at the components and explore what they are in more detail.<\/p>\n<h2>Technical SEO<\/h2>\n<p>Technical SEO is a prerequisite for Google’s ability to crawl and index your website. It is not so much a ranking factor as it is the ticket that allows you to even participate in the game.<\/p>\n<p>A well-structured website allows users and the crawlers to find exactly what they are looking for &#8211; in the best place and with the most efficient path to it.<\/p>\n<p>Technical optimisation is an indicator of a website&#8217;s health. It is the heartbeat that keeps your website alive. And it is NOT just for web developers and software developers but for all SEOs and marketers even if it sounds scary.<\/p>\n<p>You might have heard some of these ideas or concepts which are all part of the structural work on the website that is technical optimisation:<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Choosing which pages to index or de-index to maintain a focused and relevant website<\/li>\n<li>Creating a complete sitemap of all pages to tell Google what to look at<\/li>\n<li>URL structure and page hierarchy to make sure your content lives in the right place<\/li>\n<li>Internationalisation and hreflang to show Germans the German content and Spanish visitors the Spanish content<\/li>\n<li>Working with 404 errors and redirects because no one likes the “oops, this page got deleted” messages<\/li>\n<li>Server issues and server log analysis to make sure things run smoothly<\/li>\n<li>Source code, HTML and Javascript to create a lean and crawlable website<\/li>\n<li>Structured data to tell Google what page elements are<\/li>\n<li>Web speed optimisation because neither users nor Google want to wait 6 seconds<\/li>\n<li>Mobile friendliness because we are living in a mobile first world where Google prioritises the mobile experience to reward or punish desktop results.<\/li>\n<\/ul>\n<\/div>\n<p>We have not one but two modules on the textbook that are purely dedicated to technical optimisation. The main learning for now is: yes, this stuff really matters.<\/p>\n<p>And the bigger your website gets (we are talking thousands or tens of thousands of pages), the more important these factors become!<\/p>\n<h2>On-Page SEO<\/h2>\n<p>On-page SEO is the process of (keyword) optimising content to improve your rankings and search visibility on Google.<\/p>\n<p>Google’s aim is to present the user with the most relevant answer to their search query. Hence, they are trying to return the content piece that best meets the aim or search intent of the user.<\/p>\n<p>We cover this in great detail in our module for Semantic Search.<\/p>\n<p>Our job as SEOs is to give Google some hints or signposts for what our web pages are about.<\/p>\n<p>Keyword optimization can seem like a mundane or outdated activity but in reality, it still moves the needle tremendously. Why let Google guess what our article is about when we can just tell them by placing the keyword strategically?<\/p>\n<p>A word of caution though, the times of stuffing your keywords into an article are long gone! That is not what we are talking about here.<\/p>\n<p>Today, you want to think about content as the intersection between the needs of all stakeholders.<\/p>\n<p>Content allows you to communicate what you stand for, what is important to you and your business. At the same time, it allows prospects, leads, customers and clients to find answers to their questions and solve an issue or motivate them to achieve their goals.<\/p>\n<p>Content optimisation is the link between supply (your content writing) and demand (the users&#8217; needs).<\/p>\n<p>Google connects the two parts of the equation.<\/p>\n<img loading=\"lazy\" class=\"aligncenter size-full wp-image-870\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin.jpg\" alt=\"On-Page SEO Equation\" width=\"1746\" height=\"816\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin.jpg 1746w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-1536x718.jpg 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-86x40.jpg 86w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-171x80.jpg 171w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-64x30.jpg 64w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-128x60.jpg 128w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-51x24.jpg 51w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-103x48.jpg 103w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-39x18.jpg 39w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/On-Page-SEO-Equatin-77x36.jpg 77w\" sizes=\"(max-width: 1746px) 100vw, 1746px\" \/>\n<h2>Off-page SEO<\/h2>\n<p>Off-page SEO is the process of improving external ranking factors that are outside of your control. The main off-page ranking factor is backlinks.<\/p>\n<p>It also encompasses soft factors such as brand mentions, social shares or consistent entity details (name, address, phone number) and reviews.<\/p>\n<p>Off-page SEO is everything that is relying on cooperating, as well as other people talking about your business on the web.<\/p>\n<p>The most well-known part of off-page SEO (and possibly the most impactful one) is link acquisition or backlink building.<\/p>\n<p>The goal of link building is for relevant, powerful websites to link to your content, which then increases your trust and authority signals and ranking performance. Check out our module “establishing authority” to learn more about links as ranking factors.<\/p>\n<p>One of the main ranking factors for backlinks is the number of referring domains pointing to your website. If the same website inks twice to you, you will have two backlinks but one referring domain.<\/p>\n<p>There are probably diminishing returns from receiving more backlinks from the same domain, and this is why SEOs are so focused on receiving backlinks from a wide variety of unique domains.<\/p>\n<blockquote class=\"imgur-embed-pub\" lang=\"en\" data-id=\"Y7MN2Td\"><p>&nbsp;<\/p><\/blockquote>\n<p><script async src=\"\/\/s.imgur.com\/min\/embed.js\" charset=\"utf-8\"><\/script><\/p>\n<p>But successful link acquisition goes beyond the number of links.<\/p>\n<p>What’s more important is the quality and relevance of the backlinks.<\/p>\n<div class=\"tip d-flex align-items-center bg-suso-white\"><svg class=\"tip__icon d-block text-dark-blue line-height-1-5\" enable-background=\"new 0 0 29 37\" viewBox=\"0 0 29 37\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\"><g fill=\"#18217e\" opacity=\".5\"><path d=\"m28.6 26.2-2-3.2c-.2-.3-.3-.7-.3-1l-.7-10.6c-.4-5.7-4.8-10.2-10.5-10.7-6.1-.3-11.3 4.3-11.7 10.4l-.7 10.9c0 .4-.1.7-.3 1l-2 3.1c-.4.7-.5 1.5-.1 2.3.4.7 1.1 1.2 1.9 1.2h24.5c.8 0 1.6-.4 1.9-1.1.4-.8.4-1.6 0-2.3z\"\/><path d=\"m17 31.8c.5 0 1 .3 1.3.7.3.5.3 1 0 1.5-.8 1.4-2.3 2.2-3.8 2.2s-3-.8-3.8-2.2c-.3-.5-.3-1 0-1.5s.7-.7 1.3-.7z\"\/><\/g><\/svg><div class=\"entry-content\">What’s more important is the quality and relevance of the backlinks.<\/div><\/div>\n<p>Google is especially strict when it comes to link-based webspam. This is as a result of years of webmasters manipulating this ranking factor through spamful techniques like forum comments, spam backlinks, zombie websites and over-optimised anchor texts.<\/p>\n<p>A balanced, naturally looking backlink profile is the only way to receive sustainable ranking success without punishment from Google.<\/p>\n<p>These are the other success factors to consider for link building:<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Authority of the website linking to you. If they receive Google’s love, rankings and organic traffic, the link will contribute more to your ranking success.<\/li>\n<li>Strength of the specific URL that is linking to you matters equally.<\/li>\n<li>Context and relevance. If you are a food website, links from Russian gambling websites just do not make any sense. Your link sources should be relevant to your niche and the topics that you are covering in your content.<\/li>\n<li>Dofollow\/nofollow: The eternal debate. Keep in mind that you want to create a natural backlink profile. So, having a few nofollow backlinks is totally fine, even something that we want.<\/li>\n<li>A well-optimised link anchor text (the clickable element that you read on a website) is probably one of the most powerful ranking factors, but is also one of the easiest ways to look unnatural to Google. You will mainly want to receive branded or non-optimised anchor texts to look natural.<\/li>\n<\/ul>\n<\/div>\n<p>Off-page SEO is other people talking about you on the web. The more they talk and link to you, the more authoritative you will become. It is hard work, of course, and a lot of it comes down to satisfying your audience’s needs, creating a good product and building relationships.<\/p>\n<p>But link acquisition is by no means impossible and too powerful to be missed in your mix of SEO activities.<\/p>\n<h2>Combining The Components Into Your SEO Strategy<\/h2>\n<p>Today’s SEO means covering all three areas.<\/p>\n<p>They are equally important and one very deficient component can really put the brakes on your ability to outperform your competitors.<\/p>\n<img loading=\"lazy\" class=\"aligncenter size-full wp-image-871\" src=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy.jpg\" alt=\"Combining The Components Into Your SEO strategy\" width=\"1746\" height=\"1395\" srcset=\"https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy.jpg 1746w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-1536x1227.jpg 1536w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-50x40.jpg 50w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-100x80.jpg 100w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-38x30.jpg 38w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-75x60.jpg 75w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-30x24.jpg 30w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-60x48.jpg 60w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-23x18.jpg 23w, https:\/\/susodigital.com\/textbook\/wp-content\/uploads\/2020\/07\/Combining-The-Components-Into-Your-SEO-strategy-45x36.jpg 45w\" sizes=\"(max-width: 1746px) 100vw, 1746px\" \/>\n<p>At SUSO, we like to roll them out step by step.<\/p>\n<p>First, we aim to fix technical issues and clean up the website so that it is technically sound. We then look to delve deeper into improving the existing content whilst also devising a strategy for creating new content both of which can then be used to generate backlinks.<\/p>\n"},"_links":{"self":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/867"}],"collection":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules"}],"about":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/types\/module"}],"version-history":[{"count":2,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/867\/revisions"}],"predecessor-version":[{"id":872,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/867\/revisions\/872"}],"up":[{"embeddable":true,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/391"}],"wp:attachment":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/media?parent=867"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}