{"id":873,"date":"2020-07-13T23:04:49","date_gmt":"2020-07-13T22:04:49","guid":{"rendered":"https:\/\/susodigital.com\/textbook\/?post_type=module&#038;p=873"},"modified":"2020-07-13T23:04:49","modified_gmt":"2020-07-13T22:04:49","slug":"ranking-factors","status":"publish","type":"module","link":"https:\/\/susodigital.com\/textbook\/module\/what-is-seo\/ranking-factors","title":{"rendered":"Ranking Factors"},"featured_media":0,"parent":391,"menu_order":21,"template":"","acf":{"module_quiz":"","module_time":"18","module_difficulty":{"value":"easy","label":"Easy"},"module_short_description":"<p>A look at the main ranking factors for Google.<\/p>\n","module_long_description":"<p>We pick out and outline some of the most important ranking factors that determine Google's algorithm.<\/p>\n","video_file":false,"video_url":"","content":"<p>Google’s machine learning search algorithms are constantly evolving and becoming more and more sophisticated which means that the way ranking signals are evaluated and weighted are also changing.<\/p>\n<p>One thing that remains constant, however, is Google’s drive to provide its users with the best possible content and experience.<\/p>\n<p>This was playfully confirmed by Google’s John Mueller in 2017, who cited “Awesomeness” as the most important ranking factor.<\/p>\n<blockquote class=\"twitter-tweet\">\n<p dir=\"ltr\" lang=\"en\">Awesomeness.<\/p>\n<p>— 🍌 John 🍌 (@JohnMu) <a href=\"https:\/\/twitter.com\/JohnMu\/status\/905343694391439361?ref_src=twsrc%5Etfw\">September 6, 2017<\/a><\/p><\/blockquote>\n<p><script async src=\"https:\/\/platform.twitter.com\/widgets.js\" charset=\"utf-8\"><\/script><\/p>\n<p>Knowing and understanding this begs the question as to why and whether anything else should even matter.<\/p>\n<p>Regardless of what Google’s ranking factors are (there is no definitive list), the main thing to keep in mind when building and optimising your website, is your audience.<\/p>\n<p>Ultimately, it boils down to whether or not your website provides an “awesome” experience for the end user.<\/p>\n<p>Before we outline the specifics, let’s confirm what a ranking factor is.<\/p>\n<p>A ranking factor (or ranking signal) defines criteria applied by search engine algorithms to websites when evaluating and analysing web pages to determine its ability to rank for a particular search query.<\/p>\n<p>Google’s algorithms look at hundreds of ranking signals, each of which has its own weight.<\/p>\n<p>Ranking signals can be classified into the following categories:<\/p>\n<div class=\"list-styles list-styles__circle list-styles__circle--primary-color\"><ul>\n<li>Domain Level<\/li>\n<li>Page and Content Level<\/li>\n<li>Technical Implementation<\/li>\n<li>Usability<\/li>\n<li>Link Based Factors<\/li>\n<li>Webspam Factors<\/li>\n<\/ul>\n<\/div>\n<p>Instead of listing each and every ranking factor that Google looks at (here are a few great ones from <a href=\"https:\/\/backlinko.com\/google-ranking-factors#domain\" target=\"_blank\" rel=\"noopener\">Backlinko<\/a> and <a href=\"https:\/\/www.matthewwoodward.co.uk\/seo\/google-ranking-factors\/\" target=\"_blank\" rel=\"noopener\">Matthew Woodward<\/a>), we’ll briefly describe some of the most important factors that pertain to these categories.<\/p>\n<h2>Domain Level<\/h2>\n<p>Although signals such as domain age and including your core keyword in the domain name are no longer as important as they used to, Google still considers some domain-level signals as being important.<\/p>\n<p>The most important domain-level ranking signals are:<\/p>\n<ul>\n<li>Domain Security &#8211; in 2014, <a href=\"https:\/\/webmasters.googleblog.com\/2014\/08\/https-as-ranking-signal.html\">Google confirmed that HTTPS is a ranking signal<\/a>, albeit a relatively small one. This is because Google wants to provide users with a safe and secure experience.<\/li>\n<li>Country-code TLD &#8211; <a href=\"https:\/\/support.google.com\/webmasters\/answer\/182192?hl=en\">Google confirmed<\/a> that ccTLDs like .co.uk and .es “<em>are a strong signal to both users and search engines that your site is explicitly intended for a certain country<\/em>” but this may decrease your chances of ranking globally.<\/li>\n<\/ul>\n<h2>Page and Content Level<\/h2>\n<p>Content is king. If your web pages are lacking in great content, they will simply struggle to rank. In fact, Google has an entire 168-page document called the <a href=\"https:\/\/static.googleusercontent.com\/media\/guidelines.raterhub.com\/en\/\/searchqualityevaluatorguidelines.pdf\">Search Quality Evaluator Guidelines<\/a> detailing what it considers to be high-quality content.<\/p>\n<p>The most important page and content level ranking signals are:<\/p>\n<ul>\n<li><strong>Optimised Meta Tags<\/strong> &#8211; although not quite as important as it used to be, you should still include your primary keyword within <a href=\"https:\/\/www.seroundtable.com\/google-keywords-in-urls-a-small-ranking-factor-21577.html\">your URL<\/a>, <a href=\"https:\/\/www.youtube.com\/watch?v=4FkSZIW6d48#t=980\">page title<\/a>, H1 heading (and other headings) and meta description. It is worth noting that Google has confirmed <a href=\"https:\/\/webmasters.googleblog.com\/2009\/09\/google-does-not-use-keywords-meta-tag.html\">that meta descriptions are no longer a ranking signal<\/a>, however they are used by Google to display snippets in the search results.<\/li>\n<li><strong>Topical Relevance<\/strong> &#8211; Google looks at <a href=\"https:\/\/www.youtube.com\/watch?v=muSIzHurn4U\">over 200 signals<\/a> to ensure that the most relevant web pages are being displayed to users. Therefore, the topical relevance of the content on the web page is crucial.<\/li>\n<li><strong>Search Intent<\/strong> &#8211; Addressing the search intent behind the user’s query is another cornerstone of content optimisation. In fact, there are 400 mentions of “intent” in <a href=\"https:\/\/static.googleusercontent.com\/media\/guidelines.raterhub.com\/en\/\/searchqualityevaluatorguidelines.pdf\">Google’s Search Quality Rater Guidelines<\/a>, which emphasises its importance. It’s for this reason that we have also dedicated an entire module to Search Intent.<\/li>\n<li><strong>Unique Content<\/strong> &#8211; Having very similar or duplicate content on the same site <a href=\"https:\/\/support.google.com\/webmasters\/answer\/66359?hl=en\">can negatively impact<\/a> your website’s ability to rank. Ensure that each page contains unique content that addresses the user’s search intent.<\/li>\n<li><strong>Content Freshness<\/strong> &#8211; Although the frequency of content updates is not a ranking signal, ensuring that your content is up to date (for <a href=\"https:\/\/static.googleusercontent.com\/media\/guidelines.raterhub.com\/en\/\/searchqualityevaluatorguidelines.pdf\">particular search queries which demand “fresh” content<\/a>) is an important signal.<\/li>\n<li><strong>Content Length<\/strong> &#8211; Although <a href=\"https:\/\/www.reddit.com\/r\/bigseo\/comments\/clg1hn\/how_to_find_word_count_in_serp\/\">John Mueller has confirmed<\/a> that “word count is not a ranking factor”, it’s important to consider the user’s search intent to determine how long the content on a web page should be. It’s all about finding the right balance; we will explore content length in greater detail later on in the textbook.<\/li>\n<li><strong>Content Depth and Accuracy<\/strong> &#8211; One of the most important signals when it comes to content is content depth. In its <a href=\"https:\/\/support.google.com\/webmasters\/answer\/7451184?visit_id=637051210288825901-4028737426&amp;hl=en&amp;rd=3\">SEO starter guide<\/a>, Google says “<em>Creating high quality content takes a significant amount of at least one of the following: time, effort, expertise, and talent\/skill. Content should be factually accurate, clearly written, and comprehensive<\/em>”.<\/li>\n<\/ul>\n<h2>Technical Implementation<\/h2>\n<p>Some of the most important ranking signals for the technical implementations of your website are:<\/p>\n<ul>\n<li><strong>Internal Linking<\/strong> &#8211; <a href=\"https:\/\/www.youtube.com\/watch?v=oCNi7dTircw&amp;feature=youtu.be&amp;t=2882\">John Mueller emphasised<\/a> that the “<em>context we [Google] pick up from internal linking is really important to us<\/em>”.<\/li>\n<li><strong>Site Architecture<\/strong> &#8211; John Mueller highlighted the <a href=\"https:\/\/www.youtube.com\/watch?v=fCMwhn8cZD4&amp;feature=youtu.be&amp;t=2361\">importance of site architecture<\/a> recommending webmasters to “<em>avoid setting up a situation where normal website navigation doesn&#8217;t work. So we should be able to crawl from one URL to any other URL on your website just by following the links on the page<\/em>&#8220;. This largely pertains to making it easier for Google to discover and crawl your website. After all, if Google is unable to crawl your website, then it will also be unable to index and rank it.<\/li>\n<li><strong>Structured Data<\/strong> &#8211; Structured data is another factor that isn’t necessarily a direct ranking signal, but instead helps the crawlability and indexability of your web content. It’s a way of <a href=\"https:\/\/twitter.com\/JohnMu\/status\/980902538865205248\">providing more contextual information<\/a> about your website’s content to Google.<\/li>\n<\/ul>\n<h2>Usability<\/h2>\n<p>As mentioned in it’s <a href=\"https:\/\/www.google.com\/intl\/en_uk\/search\/howsearchworks\/algorithms\/\">How Search Works article<\/a>, Google “also evaluates whether webpages are easy to use” when ranking its results.<\/p>\n<p>Algorithms are employed to determine how usable a website and web page is based on factors like:<\/p>\n<ul>\n<li><strong>Browser Compatibility<\/strong> &#8211; Google <a href=\"https:\/\/support.google.com\/webmasters\/answer\/100782\">looks at<\/a> “whether the site appears correctly in different browsers”.<\/li>\n<li><strong>Page\/Site Speed<\/strong> &#8211; Introduced in 2010, site and page speed is another ranking factor that Google has <a href=\"https:\/\/webmasters.googleblog.com\/2010\/04\/using-site-speed-in-web-search-ranking.html\">explicitly confirmed<\/a> as influencing the SERPs. A fast loading web page has a higher chance of ranking in the top positions as it provides better user experience, increases engagement and improves conversion rates.<\/li>\n<li><strong>Mobile Usability<\/strong> &#8211; Now that mobile search has eclipsed desktop, Google have fully shifted to a mobile-first index. This means that ensuring that the mobile version of your website performs well has never been more important. Mobile usability is so important, that Google has created their own <a href=\"https:\/\/search.google.com\/test\/mobile-friendly\">Mobile-Friendly Test Tool<\/a>.<\/li>\n<\/ul>\n<h2>Link Based Factors<\/h2>\n<p>Backlinks form the basis of Google’s PageRank algorithm and are arguably one of the most important ranking signals that Google uses to determine a website’s ranking ability.<\/p>\n<p>There are lots of factors that contribute to Google’s evaluation of backlinks (we have listed some of these in the Web Spam factors section below), but the two most important ones are relevance and authority.<\/p>\n<p><a href=\"https:\/\/webmasters.googleblog.com\/2019\/03\/this-year-in-search-spam-webspam-report.html\">Google states<\/a>:<\/p>\n<blockquote class=\"blockquote d-flex align-items-center bg-suso-white text-dark-blue line-height-1-5\"><svg class=\"blockquote__icon d-block\" enable-background=\"new 0 0 34 29\" viewBox=\"0 0 34 29\" xmlns=\"http:\/\/www.w3.org\/2000\/svg\"><g fill=\"#18217e\" opacity=\".5\"><path d=\"m10.6 13.1c-.8-.2-1.6-.4-2.4-.4-1.2 0-2.2.3-3 .7.8-2.9 2.6-8 6.2-8.5.3-.1.6-.4.6-.7l.8-3c.1-.3 0-.5-.1-.7s-.4-.4-.6-.4c-.2-.1-.5-.1-.8-.1-4.4 0-8.7 4.8-10.5 11.6-1.1 4-1.4 10.1 1.3 13.9 1.5 2.1 3.6 3.3 6.4 3.4 3.4 0 6.5-2.4 7.4-5.9.6-2.1.3-4.2-.7-6.1s-2.7-3.2-4.6-3.8z\"\/><path d=\"m33 16.9c-1-1.9-2.6-3.2-4.6-3.8-.8-.2-1.6-.4-2.4-.4-1.2 0-2.2.3-3 .7.8-2.9 2.6-8 6.2-8.5.3-.1.6-.3.7-.7l.8-3c.1-.3 0-.5-.1-.7s-.4-.4-.6-.4c-.3-.1-.6-.1-.8-.1-4.4 0-8.7 4.8-10.5 11.6-1.1 4-1.4 10.1 1.3 13.9 1.5 2.1 3.6 3.3 6.4 3.4 3.4 0 6.5-2.4 7.4-5.9.5-2.1.2-4.2-.8-6.1z\"\/><\/g><\/svg><div><div class=\"entry-content\">“We continued to protect the value of authoritative and relevant links as an important ranking signal for search”<\/div><cite class=\"opacity-0-5\">Google<\/cite><\/div><\/blockquote>\n<ul>\n<li><strong>Relevance<\/strong> &#8211; A backlink from a domain and\/or page that is highly relevant to your website or web page is considerably more valuable than one coming from an irrelevant website. <a href=\"https:\/\/webmasters.googleblog.com\/2019\/03\/this-year-in-search-spam-webspam-report.html\">Google states<\/a> that &#8220;<em>relevant, quality inbound links can affect your PageRank<\/em>”.<\/li>\n<li><strong>Authority<\/strong> &#8211; A backlink from a highly authoritative domain and\/or page to your website or web page is considerably more valuable than one that has little to no authority itself.<\/li>\n<\/ul>\n<h2>Web Spam Factors<\/h2>\n<p>Considering how influential links are to a website’s search rankings, it comes as no surprise that Google has certain measures in place to both detect and prevent web spam.<\/p>\n<p>Below we have outlined some of the link based factors that may be manipulated and be considered as web spam by Google.<\/p>\n<ul>\n<li><strong>The number of links<\/strong> &#8211; <a href=\"http:\/\/infolab.stanford.edu\/~backrub\/google.html\">Google claims<\/a> that “<em>counting citations or backlinks to a given page… gives some approximation of a page&#8217;s importance or quality<\/em>”. However, this can easily be manipulated by webmasters who purchase or acquire lots of links for their website.<\/li>\n<li><strong>Link velocity<\/strong> &#8211; an extension of the above, websites that see an unnatural amount of links in a short period of time may be highlighted as being unnatural. <a href=\"https:\/\/patents.google.com\/patent\/US8521749B2\/en\">Google has a patent<\/a> that looks at “<em>the time-varying behavior of links to (and\/or from) a document, search engine may score the document accordingly<\/em>”.<\/li>\n<li><strong>Anchor Text<\/strong> &#8211; <a href=\"http:\/\/infolab.stanford.edu\/~backrub\/google.html\">Google acknowledges<\/a> that anchor texts “<em>often provide more accurate descriptions of web pages than the pages themselves<\/em>”, however this is something that can also be manipulated. <a href=\"https:\/\/support.google.com\/webmasters\/answer\/66356?hl=en\">Google warns against<\/a> over-optimised anchor texts.<\/li>\n<\/ul>\n<h2>How Machine Learning Impacts Rankings<\/h2>\n<p>Google’s search algorithms are primarily built on machine learning models that sit on top of the ranking factors that Google has outlined themselves.<\/p>\n<p>This means that the algorithms are constantly evolving and “learning” how to better match search queries to web pages without human input by analysing everything from language, user behaviour and usability to relevance, context and more.<\/p>\n<p>Without machine learning, this is how things would likely work:<\/p>\n<ol>\n<li>The user enters a search query.<\/li>\n<li>Google displays the search results for this query based on its conventional ranking signals.<\/li>\n<\/ol>\n<p>With machine learning, there is an extra layer of sophistication where the algorithm asks a vital question: Did the results satisfy the user’s search intent?<\/p>\n<p>Without this question being asked, there is no quality control over the search results. Google’s ranking factors are only effective to a particular point, because what happens if users do not click on the web pages that appear in the top positions?<\/p>\n<p>This clearly shows that the ranking factors aren’t as effective as calculating the best results and need tweaking.<\/p>\n<p>Here’s how things look with machine learning:<\/p>\n<ol>\n<li>The user enters a search query.<\/li>\n<li>Google displays the search results for this query based on its conventional ranking signals.<\/li>\n<li>Machine Learning: Did the results satisfy the user’s search intent?\n<ol>\n<li>No &#8211; If the answer to this question is no, the algorithm “remembers” which results did not “perform” as well (i.e. users didn’t click on these results or if they did, they left quickly), and will re-evaluate the list of pages again so that it provides a different set of results when the same search query is entered again.<\/li>\n<li>Yes &#8211; If the answer is yes, the algorithm “remembers” the results for next time that the query is entered.<\/li>\n<\/ol>\n<\/li>\n<\/ol>\n<p>To summarise, machine learning serves as a quality control layer of Google’s conventional ranking factors.<\/p>\n<p>It helps Google better understand not only how users are engaging with the search results, but it also helps improve Google’s ability to understand websites.<\/p>\n"},"_links":{"self":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/873"}],"collection":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules"}],"about":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/types\/module"}],"version-history":[{"count":6,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/873\/revisions"}],"predecessor-version":[{"id":879,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/873\/revisions\/879"}],"up":[{"embeddable":true,"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/modules\/391"}],"wp:attachment":[{"href":"https:\/\/susodigital.com\/textbook\/wp-json\/wp\/v2\/media?parent=873"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}